FROM python:3.11-slim

# Создаем именно ту структуру папок, которую вы просили
# Все последующие команды будут выполняться в этой директории
WORKDIR /app

# Копируем зависимости
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# Копируем всё содержимое папки проекта со всеми поддиректориями
# Точка в конце означает "копировать в текущий WORKDIR"
COPY . .

# Запускаем скрипт. 
# Так как мы скопировали всё в /NSLDAI/docker/app, 
# путь к файлу внутри контейнера будет именно там.
CMD ["python", "main.py"]
